function [U, Q] = division_sym(p1, p2, sm_var)
    q = p1; % остаток от деления
%     u=0;
    for i = 1:length(p1)-length(p2)+1
        u(i) = q(1)/p2(1); % коэфф-т частного
        z = [u(i)*p2, zeros(1,length(q)-length(p2))]; % умножаем и дополняем нулями
        q = q - z; % находим разность
        q(1) = []; % убираем пустую степень
    end
    % коэфф-ты
%     u % частное
%     q % остаток от деления

    % представляем в виде многочленов
    U =  u*sm_var.^(length(u)-1:-1:0).';
    Q = (q*sm_var.^(length(q)-1:-1:0).');% ./ (p2*w.^(length(p2)-1:-1:0).');
end